


/*

    ex28_modeling.sql
    
    데이터베이스 설계
    1. 요구사항 수집 및 분석
    2. 개념 데이터 모델링 
    3. 논리 데이터 모델링 
    4. 물리 데이터 모델링
    5. 데이터베이스 구축(구현)
    
    데이터 모델링
    -요구 분석 기반 > 수집한 데이터 > 분석 > 저장 구조 도식화 > 산출물 (ERD)
    -데이터를 저장하기 위한 데이터 구조를 설계하는 작업
    -ERD 만드는 작업
    - 개념 > 간단한 표현의 설계도 > 테이블 이름 + 속성 + 관계 정도만 기술
    - 논리(다이어그램) > 관계형 데이터베이스 기본 설정 > 속성(자료형, 길이) + 도메인 정의 + 키..
    - 물리(다이어그램) > 물리적 식별자 + 실제 DBMS에 맞는 세부 설정 
            논리 , 물리만 하는 경우도 있음 
            
    
    1. ERD, Entity Relationship Diagram
        - 엔티티(테이블)간의 관계를 표현한 그림 (Relationship)
        - 데이터베이스 모델링 기법 중 하나 
        - 손, 오피스, 전문툴(eXERD, ER-Win, 온라인 툴)
        
    2. Entity, 엔티티
        - 다른 Entity와 분류(구분)될 수 있고, 다른 Entity에 대해 정해진 관계를 맺을 수 있는 데이터 집합
        - 릴레이션 = 엔티티 = 레코드 > 집합(=테이블) 
    
    
    Relation > 관계 > 테이블
    Relationship > 관계 > 테이블간의 관계
*/

